tutorials/lagrangian/MPPICFoam/column/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-9.2 -9.2   0)
    ( 9.2 -9.2   0)
    ( 9.2  9.2   0)
    (-9.2  9.2   0)
    (-9.2 -9.2 300)
    ( 9.2 -9.2 300)
    ( 9.2  9.2 300)
    (-9.2  9.2 300)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 1 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sides
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }

    top
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
);

// ************************************************************************* //
